taurus-config/selenium_order_flow.yml
scenarios:
  order_flow_scenario:
    script: com.cutanddry.qa.DistributorOrderSubmissionTest
    testng-xml: target/test-classes/testng.xml

execution:
  - executor: junit
    scenario: order_flow_scenario
    concurrency: ${USERS}
    ramp-up: 10s
    hold-for: 1m

reporting:
  - module: junit-xml
    output-file: results/taurus-junit.xml
  - module: console
  - module: final-stats

modules:
  junit:
    classpath:
      - target/classes
      - target/test-classes
      - target/dependency/*.jar