taurus-config/selenium_order_flow.yml
---
execution:
  - executor: junit
    scenario: order_flow_scenario
    concurrency: ${USERS}
    ramp-up: 10s
    hold-for: 1m

#scenarios:
#  order_flow_scenario:
#    class: com.cutanddry.qa.DistributorOrderSubmissionTest
#    testng: true
#    testng-xml: src/test/resources/testng.xml
scenarios:
  order_flow_scenario:
    script: target/test-classes/DistributorOrderSubmissionTest.class
    testng-xml: src/test/resources/testng.xml

reporting:
  - module: junit-xml
    output-file: results/taurus-junit.xml
  - module: console
  - module: final-stats
#  - module: blazemeter  # Optional: Enable only if you use BlazeMeter

modules:
  junit:
    classpath:
      - target/classes
      - target/test-classes
      - target/dependency/*.jar