taurus-config/selenium_order_flow.yml
scenarios:
  order_flow_scenario:
    script: com.cutanddry.qa.DistributorOrderSubmissionTest
#    script: target/test-classes/DistributorOrderSubmissionTest.class
    testng-xml: src/test/resources/testng.xml

execution:
  - executor: testng
    scenario: order_flow_scenario
    concurrency: ${USERS}
    ramp-up: 10s
    hold-for: 1m

reporting:
  - module: junit-xml
    output-file: results/taurus-junit.xml
  - module: console
  - module: final-stats

#modules:
#  testng:
#    classpath:
#      - target/classes
#      - target/test-classes
#      - target/dependency/*.jar
modules:
  testng:
    classpath:
      - target/classes
      - target/test-classes
      - target/dependency/selenium-java-4.25.0.jar
      - target/dependency/selenium-api-4.25.0.jar
      - target/dependency/jspecify-1.0.0.jar
      - target/dependency/selenium-chrome-driver-4.25.0.jar
      - target/dependency/auto-service-annotations-1.1.1.jar
      - target/dependency/selenium-chromium-driver-4.25.0.jar
      - target/dependency/selenium-json-4.25.0.jar
      - target/dependency/selenium-manager-4.25.0.jar
      - target/dependency/selenium-devtools-v127-4.25.0.jar
      - target/dependency/selenium-devtools-v128-4.25.0.jar
      - target/dependency/selenium-devtools-v129-4.25.0.jar
      - target/dependency/selenium-devtools-v85-4.25.0.jar
      - target/dependency/selenium-edge-driver-4.25.0.jar
      - target/dependency/selenium-firefox-driver-4.25.0.jar
      - target/dependency/selenium-http-4.25.0.jar
      - target/dependency/failsafe-3.3.2.jar
      - target/dependency/selenium-ie-driver-4.25.0.jar
      - target/dependency/selenium-remote-driver-4.25.0.jar
      - target/dependency/guava-33.3.0-jre.jar
      - target/dependency/failureaccess-1.0.2.jar
      - target/dependency/listenablefuture-9999.0-empty-to-avoid-conflict-with-guava.jar
      - target/dependency/jsr305-3.0.2.jar
      - target/dependency/checker-qual-3.43.0.jar
      - target/dependency/error_prone_annotations-2.28.0.jar
      - target/dependency/j2objc-annotations-3.0.0.jar
      - target/dependency/opentelemetry-semconv-1.25.0-alpha.jar
      - target/dependency/opentelemetry-api-1.42.1.jar
      - target/dependency/opentelemetry-context-1.42.1.jar
      - target/dependency/opentelemetry-exporter-logging-1.42.1.jar
      - target/dependency/opentelemetry-sdk-common-1.42.1.jar
      - target/dependency/opentelemetry-sdk-extension-autoconfigure-spi-1.42.1.jar
      - target/dependency/opentelemetry-sdk-extension-autoconfigure-1.42.1.jar
      - target/dependency/opentelemetry-api-incubator-1.42.1-alpha.jar
      - target/dependency/opentelemetry-sdk-trace-1.42.1.jar
      - target/dependency/opentelemetry-sdk-1.42.1.jar
      - target/dependency/opentelemetry-sdk-metrics-1.42.1.jar
      - target/dependency/opentelemetry-sdk-logs-1.42.1.jar
      - target/dependency/byte-buddy-1.15.1.jar
      - target/dependency/selenium-os-4.25.0.jar
      - target/dependency/commons-exec-1.4.0.jar
      - target/dependency/selenium-safari-driver-4.25.0.jar
      - target/dependency/selenium-support-4.25.0.jar
      - target/dependency/testng-7.10.2.jar
      - target/dependency/slf4j-api-1.7.36.jar
      - target/dependency/jquery-3.7.1.jar
      - target/dependency/jackson-databind-2.17.2.jar
      - target/dependency/jackson-annotations-2.17.2.jar
      - target/dependency/jackson-core-2.17.2.jar
      - target/dependency/lombok-1.18.34.jar
      - target/dependency/slf4j-simple-1.7.32.jar
      - target/dependency/okhttp-5.0.0-alpha.14.jar
      - target/dependency/okio-jvm-3.9.0.jar
      - target/dependency/kotlin-stdlib-1.9.23.jar
      - target/dependency/annotations-13.0.jar
      - target/dependency/json-20240303.jar
      - target/dependency/commons-io-2.16.1.jar
      - target/dependency/rest-assured-5.5.0.jar
      - target/dependency/groovy-4.0.22.jar
      - target/dependency/groovy-xml-4.0.22.jar
      - target/dependency/httpclient-4.5.13.jar
      - target/dependency/httpcore-4.4.13.jar
      - target/dependency/commons-logging-1.2.jar
      - target/dependency/commons-codec-1.11.jar
      - target/dependency/httpmime-4.5.13.jar
      - target/dependency/hamcrest-2.2.jar
      - target/dependency/tagsoup-1.2.1.jar
      - target/dependency/json-path-5.5.0.jar
      - target/dependency/groovy-json-4.0.22.jar
      - target/dependency/rest-assured-common-5.5.0.jar
      - target/dependency/xml-path-5.5.0.jar
      - target/dependency/commons-lang3-3.11.jar
      - target/dependency/jakarta.mail-api-2.1.3.jar
      - target/dependency/jakarta.activation-api-2.1.3.jar
      - target/dependency/jcommander-1.82.jar