taurus-config/selenium_order_flow.yml
scenarios:
  order_flow_scenario:
    script: com.cutanddry.qa.DistributorOrderSubmissionTest
#    script: target/test-classes/DistributorOrderSubmissionTest.class
#    testng-xml: target/test-classes/testng.xml

execution:
  - executor: testng
    scenario: order_flow_scenario
    concurrency: ${USERS}
    ramp-up: 10s
    hold-for: 1m

reporting:
  - module: junit-xml
    output-file: results/taurus-junit.xml
  - module: console
  - module: final-stats

#modules:
#  testng:
#    classpath:
#      - target/classes
#      - target/test-classes
#      - target/dependency/*.jar
modules:
  testng:
    classpath:
      - target/classes
      - target/test-classes
      - target/dependency/*.jar
      - target/dependency/jcommander-1.82.jar
      - target/dependency/testng-7.10.2.jar
      - target/dependency/hamcrest-2.2.jar
      # add other required JARs as needed