taurus-config/selenium_order_flow.yml
execution:
  - executor: testng
    testng-xml: target/test-classes/testng.xml
    concurrency: ${USERS}
    ramp-up: 10s
    hold-for: 1m

reporting:
  - module: junit-xml
    output-file: results/taurus-junit.xml
  - module: console
  - module: final-stats

modules:
  testng:
    classpath:
      - target/classes
      - target/test-classes
      - target/dependency/*