taurus-config/selenium_order_flow.yml
scenarios:
  order_flow_scenario:
    executor: testng
    script: dummy.java
    testng-suite: target/test-classes/testng.xml

execution:
  - executor: testng
    scenario: order_flow_scenario
    concurrency: ${USERS}
    ramp-up: 10s
    hold-for: 1m

reporting:
  - module: junit-xml
    output-file: results/taurus-junit.xml
  - module: console
  - module: final-stats

modules:
  testng:
    classpath:
      - target/classes
      - target/test-classes
      - target/dependency/*